# Day 4

## Pandas

In [1]:
# !pip install pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.Series([1,2,3,4],['A','B','C','D'])

A    1
B    2
C    3
D    4
dtype: int64

In [4]:
df=pd.DataFrame(np.random.randint(0,101,(4,5)),['A','B','C','D'],['1','2','3','4','5'])
df

    1   2   3   4   5
A  25  41  71  33  37
B  68  49  88  59  21
C  91   2  88  38  27
D   6  58  39  99  61

In [5]:
df['3']['B']=None
df

    1   2     3   4   5
A  25  41  71.0  33  37
B  68  49   NaN  59  21
C  91   2  88.0  38  27
D   6  58  39.0  99  61

In [6]:
df.isnull().sum()

1    0
2    0
3    1
4    0
5    0
dtype: int64

In [7]:
df2=pd.DataFrame({'Name':['A','B','C','C','B'],'Value':[1,2,3,4,5]})
df2

  Name  Value
0    A      1
1    B      2
2    C      3
3    C      4
4    B      5

In [8]:
df2.groupby('Name')['Value'].sum()

Name
A    1
B    7
C    7
Name: Value, dtype: int64

In [9]:
df2.groupby('Name')['Value'].count()

Name
A    1
B    2
C    2
Name: Value, dtype: int64

In [10]:
df3=pd.DataFrame({'Name':['C','B','B','A'],'Value':[1,2,3,4]})
df3

  Name  Value
0    C      1
1    B      2
2    B      3
3    A      4

In [11]:
left=df2
right=df3

In [12]:
ax0=pd.concat([left,right])
ax1=pd.concat([left,right],axis=1)

In [13]:
print(ax0)
print(ax1)

  Name  Value
0    A      1
1    B      2
2    C      3
3    C      4
4    B      5
0    C      1
1    B      2
2    B      3
3    A      4
  Name  Value Name  Value
0    A      1    C    1.0
1    B      2    B    2.0
2    C      3    B    3.0
3    C      4    A    4.0
4    B      5  NaN    NaN